import pandas as pd

# Загрузка данных из CSV файла с пользователями
spent_data = pd.read_csv('../spent_per_capita.csv')

# Создание словаря для хранения данных о численности населения городов
city_coordinates = {
    'Москва': '55.755829, 37.617627',
    'Санкт-Петербург': '59.938670, 30.314350',
    'Екатеринбург': '56.838011, 60.597474',
    'Новосибирск': '55.030280, 82.920383',
    'Самара': '53.195878, 50.100202',
    'Казань': '55.796125, 49.106400',
    'Краснодар': '45.035470, 38.975313',
    'Челябинск': '55.159902, 61.402554',
    'Уфа': '54.735148, 55.958596',
    'Пермь': '58.010400, 56.229486',
    'Воронеж': '51.660782, 39.200286',
    'Омск': '54.989362, 73.368037',
    'Волгоград': '48.707070, 44.516952',
    'Нижний Новгород': '56.326793, 44.006437',
    'Ростов-на-Дону': '47.222104,  39.720179',
    'Красноярск': '56.010552, 92.852531'
}
# Добавление столбца с численностью населения в файл с пользователями
spent_data['city_coordinates'] = spent_data['city_nm'].map(city_coordinates)

# Сохранение результата в новый файл CSV
spent_data.to_csv('spent_with_coordinates.csv', index=False)

